<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    */

    'required' => ':attribute は必須です。',
    'email' => ':attribute は正しい形式で入力してください。',
    'alpha_num' => ':attribute は英数字のみで入力してください。',

    'min' => [
        'string' => ':attribute は :min 文字以上で入力してください。',
    ],

    'max' => [
        'string' => ':attribute は :max 文字以内で入力してください。',
    ],

    'same' => ':attribute が一致していません。',

    'confirmed' => ':attribute が一致していません。',

    /*
    |--------------------------------------------------------------------------
    | Custom Attributes
    |--------------------------------------------------------------------------
    */

    'attributes' => [
        'username' => 'ユーザー名',
        'email' => 'メールアドレス',
        'password' => 'パスワード',
        'password_confirmation' => 'パスワード確認',
        'bio' => '自己紹介',
        'icon' => 'アイコン画像',
    ],

];
